#### pandas provide two data structures for manipulating data, They are: 

1 Series

2 DataFrame

#### Series  : s a one-dimensional labelled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called indexes. 
 
 
 Pandas Series is nothing but a column in an excel sheet

###### Creating a Series

In the real world, a Pandas Series will be created by loading the datasets from existing storage, storage can be SQL Database, CSV file, an Excel file. 

Pandas Series can be created from 

the lists, 

dictionary, and 

from a scalar value etc.

In [1]:
import pandas as pd
import numpy as np
ser = pd.Series()     ## Creating empty series
print("empty series :   ",ser,"\n")
data = np.array(['g', 'e', 'e', 'k', 's'])   
ser1 = pd.Series(data)                      # creating series from array
print("series 1 : \n", ser1)
ser2 = pd.Series(list(range(1,10)))        #creating series from list
print("series 2  : \n", ser2)
ser3=pd.Series(np.array([5,6,7]))
print("series 3  : \n",ser3)
ser4=pd.Series(list(range(1,5)),index=["a","b","c","d"])  # setting index
print("series 4  : \n",ser4)

empty series :    Series([], dtype: float64)

series 1 :
 0    g
1    e
2    e
3    k
4    s
dtype: object
series 2  :
 0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64
series 3  :
 0    5
1    6
2    7
dtype: int32
series 4  :
 a    1
b    2
c    3
d    4
dtype: int64

C:\Users\acer\AppData\Local\Temp/ipykernel_2668/3453695660.py:3: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser = pd.Series()     ## Creating empty series

In [2]:
# creating series from dictionary
d = {"a": 10, "b": 20, "c": 30}
ser5 = pd.Series(data=d) 
print("series 5  : \n",ser5)   # creating series from dictionary by default keys are treated as index values
ser6 = pd.Series(data=d, index=['x', 'y', 'z'])
print("series 6  : \n",ser6)      # gives null values as there is mismatch between indexex of keys and the one which we are providing 
ser5.reset_index()                # resetting the index in case of dictionary it will take defualt index as its keys
print("resetting the index\n",ser5)

series 5  :
 a    10
b    20
c    30
dtype: int64
series 6  :
 x   NaN
y   NaN
z   NaN
dtype: float64
resetting the index
 a    10
b    20
c    30
dtype: int64

In [3]:
##Create a Series using Scalar:

##If we take the scalar values, then the index must be provided. The scalar value will be repeated for matching the length of the index.

#import pandas library   
import pandas as pd  
import numpy as np  
x = pd.Series(4, index=[0, 1, 2, 3])  
print (x)

0    4
1    4
2    4
3    4
dtype: int64

###### Accessing data from series with indexes

In [4]:
import pandas as pd  
x = pd.Series([1,2,3],index = ['a','b','c'])  
#retrieve the first element  
print (x["a"])

1

##### series function :


Pandas Series.map()	Map the values from two series that have a common column.


Pandas Series.std()	Calculate the standard deviation of the given set of numbers, DataFrame, column, and rows.


Pandas Series.to_frame()	Convert the series object to the dataframe.


Pandas Series.value_counts()	Returns a Series that contain counts of unique values.  (counts frequency excludes nan)

In [5]:
### converting series to dataframe 
s = pd.Series(["a", "b", "c"])
print(s)
print(s.dtype)
df=s.to_frame() 
print(df)
df.dtypes

0    a
1    b
2    c
dtype: object
object
   0
0  a
1  b
2  c

0    object
dtype: object

In [6]:
## counts the frequency using : series.value_counts()   
import pandas as pd  
import numpy as np  
a = pd.Series([2, 1, 1, np.nan, 3])  
a.value_counts()

1.0    2
2.0    1
3.0    1
dtype: int64

##### Series object attributes

Attributes	Description


Series.index	Defines the index of the Series.

Series.shape	It returns a tuple of shape of the data.

Series.dtype	It returns the data type of the data.

Series.size	    It returns the size of the data.

Series.empty	It returns True if Series object is empty, otherwise returns false.

Series.hasnans	It returns True if there are any NaN values, otherwise returns false.

Series.nbytes	It returns the number of bytes in the data.

Series.ndim	It returns the number of dimensions in the data.

Series.itemsize	It returns the size of the datatype of item.

##### Data Frame :
It is a two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). 

A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas 



DataFrame consists of three principal components, the data, rows, and columns.

###### The main difference between Series and Data Frame is that Series can only contain a single list with a particular index, whereas the DataFrame is a combination of more than one series that can analyze the data.

##### different ways of creating DataFrame :

1 :by loading the datasets from existing storage, storage can be SQL Database, CSV file, an Excel file. 
from python dictionaries

2.from python dictionaries

3.from python list

4.from python array

5.from list of dictionaries

In [7]:
# 1 by loading csv files 
import pandas as pd
df=pd.read_csv("D:\\python_datascience\\data sets\\examples\\ex1.csv")
print("the data frame is \n ",df)
print("the shape is rows*columns",df.shape)        # df.shape gives rows*columns of data frame

the data frame is
     a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo
the shape is rows*columns (3, 5)

In [8]:
# 2 from dictionary
import pandas as pd
data={"country":["india","uk","austria","us"],"GDP":[123,345,678,2134]}  # from dictionary 
df=pd.DataFrame(data)   # by default indexing starts from 0 and keys are the names of the columns
df

   country   GDP
0    india   123
1       uk   345
2  austria   678
3       us  2134

In [9]:
# 3. from list
import pandas as pd
l1=[1,2,3,4]
df=pd.DataFrame(l1)
print("from single list :\n",df)   # by default indexing starts from 0 and column name starts from 0
l2=[[1,2,3,4],[23,56,7,8]]
df1=pd.DataFrame(l2)
print("from nested list :\n",df1)

from single list :
    0
0  1
1  2
2  3
3  4
from nested list :
     0   1  2  3
0   1   2  3  4
1  23  56  7  8

In [10]:
# 4. from python array
import numpy as np
import pandas as pd 
df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),columns=['a', 'b', 'c'])
print(df2)

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:
## remove duplicacy of the  numbers 
import pandas as pd
data={"country":["india","uk","austria","us"],"GDP":[123,123,678,2134]}  # from dictionary 
df=pd.DataFrame(data)   # by default indexing starts from 0 and keys are the names of the columns
print(df)
df1=df["GDP"].unique()   # remove duplicacy
print("unique elements are\n",df1)

   country   GDP
0    india   123
1       uk   123
2  austria   678
3       us  2134
unique elements are
 [ 123  678 2134]

##### Dealing with rows :

 basic operations on rows like 
 
 selecting, 
 
 deleting, 
 
 adding 
 
 renaming.

  ###### Row Selection:
Pandas provide a unique method to retrieve rows from a Data frame.DataFrame.loc[] method is used to retrieve rows from Pandas DataFrame. Rows can also be selected by passing integer location to an iloc[] function. indexing,slicing,loc.iloc


###### loc : loc() is label based data selecting method which means that we have to pass the name of the row or column which we want to select. 

This method includes the last element of the range passed in it


###### iloc:  iloc() is a indexed based selecting method which means that we have to pass integer index in the method to select specific row/column. 

selecting particular number of rows and columns : df.iloc: [[2,4],[7,9]] or [:[3,4,6] ]

This method does not include the last element of the range passed

##### viewing Top rows : head()

#### head() method is used to return top n (5 by default) rows of a data frame or series.

Syntax: Dataframe.head(n=5)

Parameters:
n: integer value, number of rows to be returned

Return type: Dataframe with top n rows

In [13]:
import pandas as pd
df=pd.read_csv("D:\\python_datascience\\data sets\\examples\\csv_mindex.csv")
df1=pd.read_csv("D:\\python_datascience\\data sets\\examples\\csv_mindex.csv",index_col=["key1"])  # creating key1 as index 
print(df1,"\n")
df2=df1.head()
print("top 5 rows\n",df2)
df1.tail()
#print("last 5 rows\n",df3)    Problem

     key2  value1  value2
key1
one     a       1       2
one     b       3       4
one     c       5       6
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

top 5 rows
      key2  value1  value2
key1
one     a       1       2
one     b       3       4
one     c       5       6
one     d       7       8
two     a       9      10

     key2  value1  value2
key1
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

### to fetch specific data from data frame : slicing

In [14]:
import pandas as pd
df=pd.read_csv("D:\\python_datascience\\data sets\\examples\\csv_mindex.csv")
df1=pd.read_csv("D:\\python_datascience\\data sets\\examples\\csv_mindex.csv",index_col=["key1"])  # creating key1 as index 
print(df1,"\n")
print(df1[2:6])   # fetching rows from 2 to 5 
df1[3:]              # from row 3rd to last

     key2  value1  value2
key1
one     a       1       2
one     b       3       4
one     c       5       6
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

     key2  value1  value2
key1
one     c       5       6
one     d       7       8
two     a       9      10
two     b      11      12

     key2  value1  value2
key1
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

#####  fetching data from loc or iloc method

In [15]:
import pandas as pd
data={"country":["india","uk","austria","us"],"GDP":[123,345,678,2134]}  # from dictionary 
df=pd.DataFrame(data)
print("original df :\n",df)
print("slecting rows 1st to 3rd:",df.iloc[1:4],"\n")
df=pd.DataFrame(data,index=["a","b","c","d"])   # by default indexing starts from 0 and keys are the names of the columns
print("setting country name as indexing\n ",df)
df1=df.loc["c":"d"]
print("slecting rows based on country indexing\n",df1)

original df :
    country   GDP
0    india   123
1       uk   345
2  austria   678
3       us  2134
slecting rows 1st to 3rd:    country   GDP
1       uk   345
2  austria   678
3       us  2134

setting country name as indexing
     country   GDP
a    india   123
b       uk   345
c  austria   678
d       us  2134
slecting rows based on country indexing
    country   GDP
c  austria   678
d       us  2134

In [16]:
import pandas as pd
data={"country":["india","uk","austria","us"],"GDP":[123,345,678,2134]}  # from dictionary 
df=pd.DataFrame(data)
print("original df :\n",df)
df.iloc[[1,3],[1]]

original df :
    country   GDP
0    india   123
1       uk   345
2  austria   678
3       us  2134

    GDP
1   345
3  2134

#### addition of new rows 



 adding new rows to the DataFrame using append function. It adds the new rows at the end
 
 
 #####  various method::
append()

concat()

iloc[]

loc[]

## using append()  - add the rows of one data frame to the target dataframe at the end
Parameters

dictionary or Pandas Series or Dataframe – Object with values for new row


ignore_index = True Means the index from the series or the source dataframe will be ignored. The index available in the target dataframe will be used, instead. False means otherwise. This is optional. Returns


A resultant dataframe which has the rows from the target dataframe and a new row appended.

In [17]:
 
import pandas as pd  
d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'])  
d2 = pd.DataFrame([11, 12])  
d = d.append(d2)  
print (d)

     x     y     0
0  7.0   8.0   NaN
1  9.0  10.0   NaN
0  NaN   NaN  11.0
1  NaN   NaN  12.0

In [18]:
# importing the pandas library  
import pandas as pd  
d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'])  
d2 = pd.DataFrame([[11, 12],[2,3]])  
d = d.append(d2)  
print (d)

     x     y     0     1
0  7.0   8.0   NaN   NaN
1  9.0  10.0   NaN   NaN
0  NaN   NaN  11.0  12.0
1  NaN   NaN   2.0   3.0

In [19]:
# importing the pandas library  
import pandas as pd  
d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'])  
d2 = pd.DataFrame([[11, 12],[2,3]],columns=["x","y"])  
d = d.append(d2)  
print (d)

    x   y
0   7   8
1   9  10
0  11  12
1   2   3

In [20]:
# importing the pandas library  
import pandas as pd  
d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'],index=["a","b"])  
d2 = pd.DataFrame([[11, 12],[2,3]],columns=["x","y"])  
d1 = d2.append(d,ignore_index=True)  
print (d1)

    x   y
0  11  12
1   2   3
2   7   8
3   9  10

In [21]:
import pandas as pd
import numpy as np
  
dict = {'Name':['Martha', 'Tim', 'Rob', 'Georgia'],
        'Maths':[87, 91, 97, 95],
        'Science':[83, 99, 84, 76]
       }
  
df = pd.DataFrame(dict,index=["x","y","z","a"])
  
display(df)
  
df2 = {'Name': 'Amy', 'Maths': 89, 'Science': 93}
df = df.append(df2, ignore_index = True)
  
display(df)

      Name  Maths  Science
x   Martha     87       83
y      Tim     91       99
z      Rob     97       84
a  Georgia     95       76

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76
4      Amy     89       93

### using concat

In [22]:
import pandas as pd
import numpy as np
  
d1 = {'Name':['Martha', 'Tim', 'Rob', 'Georgia'],
        'Maths':[87, 91, 97, 95],
        'Science':[83, 99, 84, 76]
       }
d2 = {'Name': 'Amy', 'Maths': 89, 'Science': 93}
d3 = {'Name': 'Abc', 'Maths': 80, 'Science': 95}
  
df1 = pd.DataFrame(d1) 
print(df1)
df2 = pd.DataFrame(d2,index=[0]) 
print(df2)
df3 = pd.DataFrame(d3,index=[0])  
print(df3)

df = pd.concat([df1,df2,df3], ignore_index = True, axis = 0)  # adding the rows of df1+df2+df3
df

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76
  Name  Maths  Science
0  Amy     89       93
  Name  Maths  Science
0  Abc     80       95

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76
4      Amy     89       93
5      Abc     80       95

##### Using ILOC
You can use the iLoc[] attribute to add a row at a specific position in the dataframe. 

iloc is an integer-based indexing for selecting rows from the dataframe. You can also use it to assign new rows at that position.

Adding a row at a specific index position will replace the existing row at that position.

In [23]:
df

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76
4      Amy     89       93
5      Abc     80       95

In [24]:
#adding row 1 at position 3
df.iloc[3]=["balmeet",90,65]   # the existing 3rd row has been replaced by new one
df

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  balmeet     90       65
4      Amy     89       93
5      Abc     80       95

In [25]:
#adding row at the position which does not exisit in this dataframe raise an error i.e iloc doesnt not expand the size of df
r=len(df.index)  # gives new length of the rows 
print(r)
df.iloc[r]=["x",90,65]   # the existing 3rd row has been replaced by new one
df

6

IndexError: iloc cannot enlarge its target object

##### Using LOC
You can add a row to the dataframe using the loc parameter. loc[] is used to access a set of rows from the dataframe using the index label. You can also assign rows with a specific index label using the loc attribute.

When using the loc[] attribute, it’s not mandatory that a row already exists with a specific label. It’ll automatically extend the dataframe and add a row with that label, unlike the iloc[] method.

In [26]:
df

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  balmeet     90       65
4      Amy     89       93
5      Abc     80       95

In [28]:
df.loc[4]=["u",67,89]  #it also replace the existing one as iloc does
df

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  balmeet     90       65
4        u     67       89
5      Abc     80       95

In [29]:
df.loc[6]=["sanjot",98,90]  # it may add the new row if that index label is not exist unlike iloc it may enalrge the size of df
df

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  balmeet     90       65
4        u     67       89
5      Abc     80       95
6   sanjot     98       90

In [30]:
df.iloc[2:4]=(["bal",90,12],["garima",90,12])  # adding rows at specific rows numbers 
df

     Name  Maths  Science
0  Martha     87       83
1     Tim     91       99
2     bal     90       12
3  garima     90       12
4       u     67       89
5     Abc     80       95
6  sanjot     98       90

##### Row Deletion

We can delete or drop any rows from a DataFrame using the index label. 


If in case, the label is duplicate then multiple rows will be deleted.

In [31]:
###Deletion of rows:


# importing the pandas library  
import pandas as pd  
  
df1 = pd.DataFrame([[4, 5], [6, 7]], columns = ['x','y'])  
df2 = pd.DataFrame([[8, 9], [10, 11]], columns = ['x','y'])  
print("dataframe 1 :\n\n",df1)  
print("dataframe 2 :\n\n",df2)  
df1 = df1.append(df2) 
print("dataframe 1 after adding df1 :\n\n",df1)  
  

df1 = df1.drop(0)    #
print("row with index number 0 has been deleted\n\n",df1)
df1=df1.reset_index()
print(df1)
df1.drop(columns=["index"],inplace=True)
df1

dataframe 1 :

    x  y
0  4  5
1  6  7
dataframe 2 :

     x   y
0   8   9
1  10  11
dataframe 1 after adding df1 :

     x   y
0   4   5
1   6   7
0   8   9
1  10  11
row with index number 0 has been deleted

     x   y
1   6   7
1  10  11
   index   x   y
0      1   6   7
1      1  10  11

    x   y
0   6   7
1  10  11

#### columns

In [32]:
#selcting column : for one column df["columnname"] for two column: df[["columnname"]]
import pandas as pd
df=pd.read_csv("D:\\python_datascience\\data sets\\examples\\csv_mindex.csv")
df1=pd.read_csv("D:\\python_datascience\\data sets\\examples\\csv_mindex.csv",index_col=["key1"])  # creating key1 as index 
print(df1,"\n")
print(df["value1"])  # selcting particular column indexing starts from 0
print(df[["value1","value2"]])   ## selcting more than one column indexing starts from 0 : df[["columnname"]]

     key2  value1  value2
key1
one     a       1       2
one     b       3       4
one     c       5       6
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

0     1
1     3
2     5
3     7
4     9
5    11
6    13
7    15
Name: value1, dtype: int64
   value1  value2
0       1       2
1       3       4
2       5       6
3       7       8
4       9      10
5      11      12
6      13      14
7      15      16

In [33]:
## column addition 
import pandas as pd
df=pd.read_csv("D:\\python_datascience\\data sets\\examples\\csv_mindex.csv")
df1=pd.read_csv("D:\\python_datascience\\data sets\\examples\\csv_mindex.csv",index_col=["key1"])  # creating key1 as index 
print(df1,"\n")
df1["newcol1"]=list(range(1,9))  # adding new column to existing df
df1

     key2  value1  value2
key1
one     a       1       2
one     b       3       4
one     c       5       6
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

     key2  value1  value2  newcol1
key1
one     a       1       2        1
one     b       3       4        2
one     c       5       6        3
one     d       7       8        4
two     a       9      10        5
two     b      11      12        6
two     c      13      14        7
two     d      15      16        8

In [34]:
# Column Deletion:  In Order to delete a column in Pandas DataFrame, we can use the drop() method.
import pandas as pd
df=pd.read_csv("D:\\python_datascience\\data sets\\examples\\csv_mindex.csv")
df1=pd.read_csv("D:\\python_datascience\\data sets\\examples\\csv_mindex.csv",index_col=["key1"])  # creating key1 as index 
print(df1,"\n")
df1.drop(columns=["value1"],inplace=True)
#df1.drop(["value1"],inplace=True)
print(df1)
df1.drop(["key2","value2"],axis=1,inplace=True)  
print(df1)

     key2  value1  value2
key1
one     a       1       2
one     b       3       4
one     c       5       6
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

     key2  value2
key1
one     a       2
one     b       4
one     c       6
one     d       8
two     a      10
two     b      12
two     c      14
two     d      16
Empty DataFrame
Columns: []
Index: [one, one, one, one, two, two, two, two]

In [35]:
## adding categorical data column
import numpy as np
import pandas as pd
df=pd.DataFrame({"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"c":[1,2,3]})  #np.nan is used to add missing values 
df["cat_col"]=pd.Series("A B C".split())
df

     A    B  c cat_col
0  1.0  5.0  1       A
1  2.0  NaN  2       B
2  NaN  NaN  3       C

#### wap to create dataframe from dictionary and add new columns to it

In [36]:
import pandas as pd
import numpy as np
data={"country":["india","uk","austria","us"],"GDP":[123,345,678,2134]}  # from dictionary 
df=pd.DataFrame(data)
print(df)
l=[]
##l1=[]
for i in df["GDP"]:
    square=i*i
    l.append(square)
    #l1.append(round(np.log(i),2)
df["gdp_square"]=pd.Series(l)
print(df)
df["gdp_logvalues"]=pd.Series(l1)
df

   country   GDP
0    india   123
1       uk   345
2  austria   678
3       us  2134
   country   GDP  gdp_square
0    india   123       15129
1       uk   345      119025
2  austria   678      459684
3       us  2134     4553956

   country   GDP  gdp_square  gdp_logvalues
0    india   123       15129              1
1       uk   345      119025              2
2  austria   678      459684              3
3       us  2134     4553956              4